//-----------------------------------------------<< Komenda >>-----------------------------------------------//
//-----------------------------------------------[ startlotto ]----------------------------------------------//
//----------------------------------------------------*------------------------------------------------------//
//----[                                                                                                 ]----//
//----[         |||||             |||||                       ||||||||||       ||||||||||               ]----//
//----[        ||| |||           ||| |||                      |||     ||||     |||     ||||             ]----//
//----[       |||   |||         |||   |||                     |||       |||    |||       |||            ]----//
//----[       ||     ||         ||     ||                     |||       |||    |||       |||            ]----//
//----[      |||     |||       |||     |||                    |||     ||||     |||     ||||             ]----//
//----[      ||       ||       ||       ||     __________     ||||||||||       ||||||||||               ]----//
//----[     |||       |||     |||       |||                   |||    |||       |||                      ]----//
//----[     ||         ||     ||         ||                   |||     ||       |||                      ]----//
//----[    |||         |||   |||         |||                  |||     |||      |||                      ]----//
//----[    ||           ||   ||           ||                  |||      ||      |||                      ]----//
//----[   |||           ||| |||           |||                 |||      |||     |||                      ]----//
//----[  |||             |||||             |||                |||       |||    |||                      ]----//
//----[                                                                                                 ]----//
//----------------------------------------------------*------------------------------------------------------//

// Opis:
/*
	
*/


// Notatki skryptera:
/*
	
*/

YCMD:startlotto(playerid, params[], help)
{
	new string[128];

    if(IsPlayerConnected(playerid))
    {
        if(PlayerInfo[playerid][Admin] >= 2000)
        {
            format(string, sizeof(string), "Nowoœci lotto: Losowanie rozpoczête.");
            OOCOff(COLOR_WHITE, string);
            new rand = true_random(80);
            if(rand < 77) { rand += 3; }
            Lotto(rand);

            format(string, sizeof(string), "CMD_Info: /startlotto u¿yte przez %s [%d]", GetNickEx(playerid), playerid);
            SendCommandLogMessage(string);
	        Log(adminLog, INFO, "Admin %s u¿y³ /startlotto", GetPlayerLogName(playerid));
        }
        else
        {
            noAccessMessage(playerid);
            return 1;
        }
    }
	return 1;
}
