//-----------------------------------------------<< Komenda >>-----------------------------------------------//
//--------------------------------------------------[ noa ]--------------------------------------------------//
//----------------------------------------------------*------------------------------------------------------//
//----[                                                                                                 ]----//
//----[         |||||             |||||                       ||||||||||       ||||||||||               ]----//
//----[        ||| |||           ||| |||                      |||     ||||     |||     ||||             ]----//
//----[       |||   |||         |||   |||                     |||       |||    |||       |||            ]----//
//----[       ||     ||         ||     ||                     |||       |||    |||       |||            ]----//
//----[      |||     |||       |||     |||                    |||     ||||     |||     ||||             ]----//
//----[      ||       ||       ||       ||     __________     ||||||||||       ||||||||||               ]----//
//----[     |||       |||     |||       |||                   |||    |||       |||                      ]----//
//----[     ||         ||     ||         ||                   |||     ||       |||                      ]----//
//----[    |||         |||   |||         |||                  |||     |||      |||                      ]----//
//----[    ||           ||   ||           ||                  |||      ||      |||                      ]----//
//----[   |||           ||| |||           |||                 |||      |||     |||                      ]----//
//----[  |||             |||||             |||                |||       |||    |||                      ]----//
//----[                                                                                                 ]----//
//----------------------------------------------------*------------------------------------------------------//

// Opis:
/*
	
*/


// Notatki skryptera:
/*
	
*/

CMD:fdu(playerid, params[]) return cmd_noa(playerid, params);
CMD:noa(playerid, params[])
{
	new string[256];
	new sendername[MAX_PLAYER_NAME];

	if(IsANoA(playerid) && PlayerInfo[playerid][pRank] >= 6)
	{
		GetPlayerName(playerid, sendername, sizeof(sendername));
		if(isnull(params))
		{
			sendTipMessage(playerid, "U¿yj /FDU [tresc]");
			return 1;
		}
		SendClientMessageToAll(0xA400A4C8,"|____________[WIADOMOSC FDU]____________|");
		format(string, sizeof(string), "%s: %s", sendername, params);
		SendClientMessageToAll(COLOR_GREY, string);
		printf("%s", string);
	}
	else
	{
		sendErrorMessage(playerid,"Nie jesteœ z FDU/nie masz 6 rangi");
	}
	return 1;
}

